app/controllers/api/annotations_controller.rb

  def index
    @annotations = Annotation.all
---
SELECT "annotations".* FROM "annotations"

  def create
    @annotation = Annotation.new(annotation_params)
    @annotation.user_id = current_user.id
    @annotation.track_id = params[:track_id]

    if @annotation.save
---
INSERT INTO "annotations" ("body", "track_id", "user_id", "start_index", "end_index", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["body", "THIS WAS CREATED."], ["track_id", 17], ["user_id", 5], ["start_index", 34], ["end_index", 233], ["created_at", "2018-03-11 23:50:20.606625"], ["updated_at", "2018-03-11 23:50:20.606625"]]

  def show
    @annotation = Annotation.find(params[:id])
---
SELECT  "annotations".* FROM "annotations" WHERE "annotations"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def destroy
    @annotation = Annotation.find(params[:id])
    if @annotation && @annotation.user_id === current_user.id
      @annotation.destroy
---
SELECT  "annotations".* FROM "annotations" WHERE "annotations"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
DELETE FROM "annotations" WHERE "annotations"."id" = $1  [["id", 6]]