app/controllers/api/tracks_controller.rb

  def create
    @track = current_user.tracks.new(track_params)
      if  @track.title.length < 31 && @track.artist.length < 31 && @track.album.length < 31 && @track.lyrics.length < 10000 && @track.save
---
INSERT INTO "tracks" ("title", "artist", "album", "genre", "lyrics", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def index
    @tracks = Track.all
---
SELECT "tracks".* FROM "tracks" ORDER BY "tracks"."created_at" DESC

  def show
    @track = Track.includes(:annotations).find(params[:id])
---
SELECT  "annotations".* FROM "annotations" WHERE "annotations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]

  def destroy
    @track = Track.find(params[:id])

    if @track && @track.user_id === current_user.id
      @track.destroy
---
SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "tracks" WHERE "tracks"."id" = $1  [["id", 2]]

  def update
    @track = Track.find(params[:id])

    if @track.user_id === current_user.id && @track.update(track_params)
---
SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
UPDATE "tracks" SET "title" = $1, "updated_at" = $2 WHERE "tracks"."id" = $3  [["title", "poop"], ["updated_at", "2018-03-11 05:36:13.128489"], ["id", 14]]