app/views/api/tracks/index.json.jbuilder

    json.partial! '/api/tracks/track', track: track
    json.annotation_ids track.annotations.pluck(:id)
    json.annotations do
      track.annotations.each do |annotation|
---
SELECT "annotations"."id" FROM "annotations" WHERE "annotations"."track_id" = $1  [["track_id", 20]]
SELECT "annotations".* FROM "annotations" WHERE "annotations"."track_id" = $1  [["track_id", 16]]