app/views/api/tracks/show.json.jbuilder

  json.partial! 'api/tracks/track', track: @track
  json.annotation_ids @track.annotations.pluck(:id)
---
SELECT "annotations"."id" FROM "annotations" WHERE "annotations"."track_id" = $1  [["track_id", 13]]

json.annotations do
  @track.annotations.each do |annotation|
---
SELECT "annotations".* FROM "annotations" WHERE "annotations"."track_id" = $1  [["track_id", 14]]